-- Gro-goroth
local icon = {
    type = "text",

    opts = {
        hl = "Type",
        position = "center",
    },

    val = {
        "⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠘⡇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀",
        "⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⢳⡀⠀⠀⠀⠀⢻⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀",
        "⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠹⣆⠀⠀⠀⠘⣇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀",
        "⠀⠀⠀⠀⠲⣤⡀⠀⠀⠀⠀⠀⠘⢧⣀⣤⠶⠿⠒⠒⠶⠶⢦⣤⣀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀",
        "⠀⠀⠀⠀⠀⠀⠙⠶⣄⠀⠀⣠⡴⠛⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠉⠳⢦⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀",
        "⠀⠀⠀⠀⠀⠀⠀⠀⠈⢛⡾⠃⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠙⣦⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀",
        "⠀⠛⠶⢤⣄⣀⠀⠀⢠⠟⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⢷⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀",
        "⠀⠀⠀⠀⠈⠉⠛⢳⡟⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⣧⠀⠀⠀⠀⠀⠀⠀⠀⠀",
        "⠀⠀⠀⠀⠀⠀⠀⢸⠃⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢸⡄⠀⠀⠀⠀⠀⠀⠀⠀",
        "⠀⠀⠀⠀⠀⠀⠀⣿⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣀⣤⣤⣼⣧⣀⡀⠀⠀⠀⠀⠀⠀",
        "⠀⠀⠀⠀⠀⠀⠀⢹⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣴⠞⠉⠀⠀⢸⡇⠈⠙⢦⡀⠀⠀⠀⠀",
        "⠀⠀⠀⠀⠀⠀⠀⠸⣇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⡾⠁⠀⠀⠀⠀⣼⠀⠀⠀⠀⠹⡄⠀⠀⠀",
        "⠀⠀⠀⠀⠀⠀⠀⠀⠹⡄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢸⠇⠀⠀⠀⠀⣰⠃⠀⠀⠀⠀⠀⣷⠀⠀⠀",
        "⠀⠀⠀⠀⠀⠀⠀⠀⠀⠹⣆⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢸⡇⠀⠀⢀⡴⠃⠀⠀⠀⠀⠀⠀⡿⠀⠀⠀",
        "⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⠳⣄⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢳⣄⡴⠛⠀⠀⠀⠀⠀⠀⠀⣼⠃⠀⠀⠀",
        "⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⠙⠳⢦⣤⣀⣀⣀⣀⣠⣤⠴⠞⠛⢦⣄⡀⠀⠀⠀⣀⣤⠞⠁⠀⠀⠀⠀",
        "⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⠉⠉⠉⠀⠀⠀⠀⠀⠀⠈⠉⠛⠛⠋⠉⠀⠀⠀⠀⠀⠀⠀",
    },
}

local startpage = {
    layout = {
        { type = "padding", val = 5 },
        icon,
        { type = "padding", val = 6 },
        {
            type = "button",
            val = "  Find File",
            on_press = function() vim.cmd("Telescope find_files") end,
            opts = {
                shortcut = "f",
                keymap = {
                    "n",
                    "f",
                    "<cmd>Telescope find_files<cr>",
                    {
                        noremap = true,
                        silent = true,
                        nowait = true,
                    }
                },

                position = "center",
                cursor = 3,
                width = 40,

                align_shortcut = "right",
                hl_shortcut = "Keyword",
            },
        },
        { type = "padding", val = 1 },
        {
            type = "button",
            val = "  New File",
            on_press = function() vim.cmd [[ene]] end,
            opts = {
                shortcut = "n",
                keymap = {
                    "n",
                    "n",
                    ":ene <BAR> startinsert <CR>",
                    {
                        noremap = true,
                        silent = true,
                        nowait = true,
                    }
                },

                position = "center",
                cursor = 3,
                width = 40,

                align_shortcut = "right",
                hl_shortcut = "Keyword",
            },
        },

        { type = "padding", val = 1 },
        {
            type = "button",
            val = "  Quit",
            on_press = function() vim.cmd [[qa]] end,
            opts = {
                shortcut = "q",
                keymap = {
                    "n",
                    "q",
                    ":qa<CR>",
                    {
                        noremap = true,
                        silent = true,
                        nowait = true,
                    }
                },

                align_shortcut = "right",
                hl_shortcut = "Keyword",

                position = "center",
                cursor = 3,
                width = 40,
            },
        },
    },
    opts = {
        margin = 5,
    },
}

require("alpha").setup(startpage)
